---
type: AnalysisDisplayColorSettings
namespace: Autodesk.Revit.DB.Analysis
version: 2024
members: 12
tags: [revit-api, class]
---

# AnalysisDisplayColorSettings

`Autodesk.Revit.DB.Analysis.AnalysisDisplayColorSettings` · Revit 2024 · 12 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | AnalysisDisplayColorSettings | — | `` |
| Constructor | AnalysisDisplayColorSettings | 2011 | `public AnalysisDisplayColorSettings ()` |
| Method | AreIntermediateColorsValid | 2011 | `public bool AreIntermediateColorsValid ( IList < AnalysisDisplayColorEntry > map )` |
| Method | Colors | 2011 | `public int Colors ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetIntermediateColors | 2011 | `public IList < AnalysisDisplayColorEntry > GetIntermediateColors ()` |
| Method | IsEqual | 2011 | `public bool IsEqual ( AnalysisDisplayColorSettings other )` |
| Method | SetIntermediateColors | 2011 | `public void SetIntermediateColors ( IList < AnalysisDisplayColorEntry > map )` |
| Property | ColorSettingsType | 2011 | `public AnalysisDisplayStyleColorSettingsType ColorSettingsType { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | MaxColor | 2011 | `public Color MaxColor { get ; set ; }` |
| Property | MinColor | 2011 | `public Color MinColor { get ; set ; }` |